Autodesk.Navisworks.Api.DocumentParts.DocumentGrids
Stores the Grids information contained in a Document.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.ActiveSystem
The GridSystem that will be rendered.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.Changed
Occurs when the GridsData contained in this object has changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.Changing
Occurs when the GridsData contained in about to change.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.RenderMode
The GridSystem that will be rendered.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.SetSystemLockedLevel(Autodesk.Navisworks.Api.GridSystem,Autodesk.Navisworks.Api.GridLevel)
Sets the LockedLevel for a particular System.

Autodesk.Navisworks.Api.DocumentParts.DocumentGrids.Systems
The collection of all GridSystems within the Document.